""" Придумайте по одному примеру использования каждого типа данных: list, tuple, set, dictionary.
Например, при помощи словаря мы можем не только делать быстрый поиск квартир (как в лекции),
но и хранить "записную книжку """

# list: Список участников, зарегистрировавшихся на вебинар.
meetup_people = ['Johh', 'Mary', 'Ivan', 'Nastya']

# turple: Фитчи,указанные в ТЗ для проекта
fitchi = ('LeftSide bar', 'Search line', 'Content with Cards')

# set: список уникальных подарков на день рождение
unique_presents = {'Ручка', 'Блокнот', '2000 рублей', 'Открытка'}

# dict: Должники
debtors = {'Ivan': 100,
           'Vasya': 200,
           'Mary': 300}


